#!/bin/bash

echoc() {
	TC=('\033[30m' '\033[31m' '\033[32m' '\033[33m' '\033[34m' '\033[35m' '\033[36m' '\033[37m')
	BC=('\033[40m' '\033[41m' '\033[42m' '\033[43m' '\033[44m' '\033[45m' '\033[46m' '\033[47m')
	CCE='\033[0;0m'
	if [[ $1 != [[:digit:]] || $2 != [[:digit:]] ]] ;then
		echo -e "参数错误！用法如下："
		echo -e "echoc 0~7 0~7 \"YOUR_TEXT\""
		echo -e "~~~~~~~~~~~~~~~~~~~~~~~~~"
		echo -e "参数1：${TC[0]}0${CCE} ${TC[1]}1${CCE} ${TC[2]}2${CCE} ${TC[3]}3${CCE} ${TC[4]}4${CCE} ${TC[5]}5${CCE} ${TC[6]}6${CCE} ${TC[7]}7${CCE}"
		echo -e "参数2：${BC[0]}0${CCE} ${BC[1]}1${CCE} ${BC[2]}2${CCE} ${BC[3]}3${CCE} ${BC[4]}4${CCE} ${BC[5]}5${CCE} ${BC[6]}6${CCE} ${BC[7]}7${CCE}"
	fi
	echo -e "${TC[$1]}${BC[$2]}$3${CCE}"
}

echoc $1 $2 "$3"
